----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
         Embedding-1              [-1, 10, 256]       1,280,000
            Linear-2                  [-1, 512]       1,049,088
            Linear-3                  [-1, 512]       1,049,088
            Linear-4              [-1, 49, 256]         524,544
            Linear-5                  [-1, 256]         131,328
            Linear-6                [-1, 49, 1]             257
         Attention-7     [[-1, 49], [-1, 2048]]               0
          LSTMCell-8     [[-1, 512], [-1, 512]]               0
           Dropout-9                  [-1, 512]               0
           Linear-10                 [-1, 5000]       2,565,000
           Linear-11              [-1, 49, 256]         524,544
           Linear-12                  [-1, 256]         131,328
           Linear-13                [-1, 49, 1]             257
        Attention-14     [[-1, 49], [-1, 2048]]               0
         LSTMCell-15     [[-1, 512], [-1, 512]]               0
          Dropout-16                  [-1, 512]               0
           Linear-17                 [-1, 5000]       2,565,000
           Linear-18              [-1, 49, 256]         524,544
           Linear-19                  [-1, 256]         131,328
           Linear-20                [-1, 49, 1]             257
        Attention-21     [[-1, 49], [-1, 2048]]               0
         LSTMCell-22     [[-1, 512], [-1, 512]]               0
          Dropout-23                  [-1, 512]               0
           Linear-24                 [-1, 5000]       2,565,000
           Linear-25              [-1, 49, 256]         524,544
           Linear-26                  [-1, 256]         131,328
           Linear-27                [-1, 49, 1]             257
        Attention-28     [[-1, 49], [-1, 2048]]               0
         LSTMCell-29     [[-1, 512], [-1, 512]]               0
          Dropout-30                  [-1, 512]               0
           Linear-31                 [-1, 5000]       2,565,000
           Linear-32              [-1, 49, 256]         524,544
           Linear-33                  [-1, 256]         131,328
           Linear-34                [-1, 49, 1]             257
        Attention-35     [[-1, 49], [-1, 2048]]               0
         LSTMCell-36     [[-1, 512], [-1, 512]]               0
          Dropout-37                  [-1, 512]               0
           Linear-38                 [-1, 5000]       2,565,000
           Linear-39              [-1, 49, 256]         524,544
           Linear-40                  [-1, 256]         131,328
           Linear-41                [-1, 49, 1]             257
        Attention-42     [[-1, 49], [-1, 2048]]               0
         LSTMCell-43     [[-1, 512], [-1, 512]]               0
          Dropout-44                  [-1, 512]               0
           Linear-45                 [-1, 5000]       2,565,000
           Linear-46              [-1, 49, 256]         524,544
           Linear-47                  [-1, 256]         131,328
           Linear-48                [-1, 49, 1]             257
        Attention-49     [[-1, 49], [-1, 2048]]               0
         LSTMCell-50     [[-1, 512], [-1, 512]]               0
          Dropout-51                  [-1, 512]               0
           Linear-52                 [-1, 5000]       2,565,000
           Linear-53              [-1, 49, 256]         524,544
           Linear-54                  [-1, 256]         131,328
           Linear-55                [-1, 49, 1]             257
        Attention-56     [[-1, 49], [-1, 2048]]               0
         LSTMCell-57     [[-1, 512], [-1, 512]]               0
          Dropout-58                  [-1, 512]               0
           Linear-59                 [-1, 5000]       2,565,000
           Linear-60              [-1, 49, 256]         524,544
           Linear-61                  [-1, 256]         131,328
           Linear-62                [-1, 49, 1]             257
        Attention-63     [[-1, 49], [-1, 2048]]               0
         LSTMCell-64     [[-1, 512], [-1, 512]]               0
          Dropout-65                  [-1, 512]               0
           Linear-66                 [-1, 5000]       2,565,000
================================================================
Total params: 32,368,337
Trainable params: 32,368,337
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.38
Forward/backward pass size (MB): 23.60
Params size (MB): 123.48
Estimated Total Size (MB): 147.46
----------------------------------------------------------------
